export default {
    host: 'http://vueapi.kmfx1.com',
    ip: 'http://vueapi.kmfx1.com',
    secret: {
        key: '321cfsdaxfmk9102',
        iv: '2019kmfxadsfc123'
    },
    wx: {
        // appid: "wx59179ad9d77ec74c",
        // secret: "51d9cabdab691c88568e36ca693bc892",
        appid: "wx5340a87208fd241f",
        secret: "b0d230de401ee1f0b5bd0e894377e9f2",
    },
    agreement: {
        agent: `            视频彩铃广告代言服务协议

1. 服务条款的接受与修改
    1.1 本协议是视频彩铃广告投放代言人与昆明旭宏文化传播有限公司（下称“旭宏”）之间关于用户成为视频彩铃广告投放代言人且获得旭宏提供的相应权益所订立的协议。本协议描述旭宏与视频彩铃广告投放代言人之间关于视频彩铃广告投放代言许可以及获得旭宏提供的相应权益相关方面的权利义务。“视频彩铃广告投放代言人”是指完成了成为视频彩铃广告投放代言人的全部程序（包括视频彩铃广告投放代言、同意本协议全部内容等），且在遵守旭宏相关规则下使用旭宏提供的相应权益的自然人。
    1.2 本服务协议构成您使用旭宏所提供的相应权益之先决条件，旭宏已经以字体加粗或其他合理方式提示您重点阅读协议中相关免除或限制责任条款，视频彩铃广告投放代言人和旭宏均认可其合法性及有效性。除非您接受本协议全部条款，否则您无权使用本协议的相关权益。
    1.3 您的行为（包括但不限于点击同意、进行下一步操作等）将视为同意接受本协议各项条款及相关子协议、页面说明或规范流程等全部内容的约束。
    1.4 旭宏有权随时对服务条款进行修改，一旦服务条款发生变更和修改，旭宏将在相关页面上进行公告，并提醒代言人查看，且修改内容在公告之日的10日后生效和执行；如果视频彩铃广告投放代言人不同意本协议的任一修改，可以取消已经授权的视频彩铃广告投放代言并停止获得旭宏提供的相应权益；如果视频彩铃广告投放代言人继续使用旭宏提供的相应权益，则视为视频彩铃广告投放代言人已经接受本协议的全部修改。
    1.5 请您仔细审阅本协议的全部内容并选择是否同意本协议。未满18周岁的未成年人应在法定监护人陪同下审阅和履行，未成年人同意成为视频彩铃广告投放代言人、行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可。您在成为视频彩铃广告投放代言人并享受旭宏提供的相应权益时必须完全、严格遵守本服务协议条款。
         
2. 服务说明 
    2.1 本协议为《视频彩铃广告投放代言协议》，视频彩铃广告投放代言人在享受旭宏提供的相应权益服务时，都应当受本协议各类公告、页面说明或规范流程等内容的约束。
    2.2 旭宏公司仅通过您的申请同意您作为视频广告代言人的资格，由您自行承担在代言过程中发生的个人行为的法律责任。如因您个人的行为导致旭宏商誉受损、侵害第三方权益的，旭宏将保留对您追究法律责任的权利，届时，将由您承担旭宏公司为此而支出的一切费用（费用包含但不限于诉讼费、律师费、公证费、鉴定费、交通费等）。旭宏享有对视频彩铃广告投放代言人在视频彩铃广告投放代言及其关联公司提供的服务平台上的一切活动的监督、提示、检查的权利，如视频彩铃广告投放代言人的行为违反有关法律法规或违反本协议条款的约定，旭宏享有要求其纠正及追究其责任等权利，并且由此造成的一切法律责任由视频彩铃广告投放代言人自行承担。
    2.3 您明确了解并同意，视频彩铃广告投放代言的操作方式为代理广告方投放于代言人手机端的视频彩铃广告，您通过此种方式可能存在一定的商业风险，该风险会给您造成相应的损失，您应自行承担向侵权方追究侵权责任和追究责任不能的后果。
    2.4 您应自行负责妥善且正确地保管、使用、维护您在移动申请取得的号卡账户、账户信息及账户密码。您应对您号卡账户信息和账户密码采取必要和有效的保密措施。非旭宏原因致使您账户密码泄露以及因您保管、使用、维护不当造成损失的，旭宏无须承担与此有关的任何责任。
    2.5 旭宏不对您因第三方的行为或不作为造成的损失承担任何责任，包括但不限于广告代言服务和网络接入服务、任意第三方的侵权行为或其他违法违规行为。 
         
3. 成为视频彩铃广告代言人的程序 
    3.1 在成为旭宏视频彩铃广告代言人之前，您必须先根据真实、准确信息注册成为旭宏的移动视频彩铃用户。用户所填写的内容与个人资料必须真实有效，否则旭宏有权拒绝其申请或撤销您的视频彩铃广告代言人资格，并不予任何赔偿。视频彩铃广告代言人个人资料发生变化的，您应及时修改注册的个人资料，否则由此造成的视频彩铃广告代言人权利不能全面有效行使或无法获取旭宏最新通知的损失和责任均由视频彩铃广告代言人自行承担，且旭宏有权因此取消您的视频彩铃广告代言人资格，并不予支付其他任何形式的任何赔偿。
    3.2 用户可通过各种已有和未来新增的注册渠道成为视频彩铃广告代言人，包括但不限于：通过公众号、网页链接或第三方推广方式等现有或今后旭宏指定的方式成为视频彩铃广告代言人（具体注册渠道仍以旭宏实际接受或说明为准）。只有当用户根据页面提示确认愿意并成功注册以及完成了成为旭宏视频彩铃广告代言人的其他所有程序，且通过旭宏审核后，用户方可享受旭宏视频彩铃广告代言人服务。如您拒绝填写真实信息或不同意本协议任一条款或不同意成为旭宏视频彩铃广告代言人的其他任一程序的，则不能进行相关的视频彩铃广告代言。在用户使用具体某种方式成为视频彩铃广告代言人时，须阅读并确认接受相关的服务条款和使用规则。旭宏在此声明：旭宏从未授权任何第三方单位或个人销售、转让旭宏视频彩铃广告代言人资格，任何未经旭宏明示授权而销售、转让旭宏视频彩铃广告代言人资格的行为属于非法销售、非法转让，旭宏有权追究其法律责任。同时，对于如何成为视频彩铃广告代言人，旭宏将在相关页面上为用户做出每一步的明确操作提示。
    3.3 您不得通过以下任何方式为自己或他人（申请）开通视频彩铃广告代言人资格，否则，旭宏有权不经通知拒绝申请或撤销相关用户的视频彩铃广告代言人资格，并不支付其他任何形式的任何赔偿，同时旭宏有权追究相关的法律责任：
        3.3.1 未经过合法授权，以营利、经营等非个人使用的目的为自己或他人（申请）开通视频彩铃广告代言人资格；
        3.3.2 通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式非法（申请）开通视频彩铃广告代言人资格；
        3.3.3 通过非旭宏指定的其他方式（申请）开通视频彩铃广告代言人资格；
        3.3.4 通过侵犯旭宏或/及其关联公司或第三方合法权益，或其他不正当的，或违反诚实信用原则的方式；
        3.3.5 通过其他违反相关法律、行政法规、国家政策等方式。
    3.4 成为视频彩铃广告代言人后，视频彩铃广告代言人有权利选择不继续接受旭宏的视频彩铃广告代言，视频彩铃广告代言人可申请取消代言服务，但此取消行为将无法获得其他任何形式的任何补偿/赔偿。
    3.5  旭宏仅提供相关的广告投放服务，除此之外与相关广告投放服务有关的设备（如个人手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费、移动彩铃费、视频彩铃功能费）均应由视频彩铃广告代言人自行负担。 

4. 视频彩铃广告投放代言服务和账号查询 
    4.1 一旦您成为视频彩铃广告代言人，即视为您认可该项服务；成为旭宏视频彩铃广告代言人后，该项服务即时生效。
    4.2 视频彩铃广告代言人所获得的相应权益以旭宏标注的详细权益为准，旭宏有权基于自身业务发展需要变更上述权益标准，但旭宏会根据实际运营情况对不同阶段已经注册代言且持续有效的视频彩铃广告代言人给予相应权益，具体权益以旭宏在相关服务页面公告的内容为准。
    4.3 您可以通过登录旭宏视频彩铃平台免费查询您的账号信息详情。
         
5. 旭宏视频彩铃广告代言的服务期限
    5.1 成为旭宏视频彩铃广告代言人，即可享受旭宏为视频彩铃广告代言人提供的相应权益，包括但不限于购物券、各类视频会员、实物礼品等。您理解并同意，鉴于视频彩铃广告代言类型的多样性，不同类型的视频广告代言享有不同的代言权益。同时，旭宏有权根据市场情况对视频彩铃广告代言权益进行全部或部分的变更、取消、增加。如您的视频彩铃广告代言权益与本条不符的，具体内容以旭宏“视频彩铃代言人”页面的说明或实际提供为准。
    5.2 关于广告的特别说明：您在进行视频彩铃广告投放代言的过程中，同意本协议将视为同意旭宏以各种方式投放的合法商业性广告或其他类型的商业信息。
    5.3 旭宏致力于不断改善自身服务，力求为您提供愈加优质的服务。视频彩铃广告代言获得的权益标准由旭宏根据自身运营策略独立决定，并在视频彩铃广告代言签约页面向您显示。您同意您继续操作的行为（包括但不限于点击同意、进行下一步操作等），即视为您知悉并同意该标准。
         
6. 视频彩铃广告代言人个人信息保密的免责条款
    6.1 旭宏将会采取合理的措施保护视频彩铃广告代言人的个人信息。未经您的同意，旭宏不会向旭宏以外的任何公司、组织、个人披露您的个人信息，但法律法规另有规定的除外。
        
7. 视频彩铃广告代言人的权利及限制 
    7.1 视频彩铃广告代言有效期内，视频彩铃广告代言人可获得由旭宏提供的各项优惠及权益。
    7.2 视频彩铃广告代言人获得的权益仅限于自行使用；禁止转让或售卖。否则旭宏有权在未经通知的情况下取消该权益，由此带来的损失由视频彩铃广告代言人自行承担。
    7.3 视频彩铃广告代言人在进行视频彩铃广告代言时，如遭受任何人身或财产的损失、损害或伤害，除法律规定的责任外，旭宏或及其关联公司均不承担责任。
    7.4 视频彩铃广告代言人承诺在任何情况下均不得发表、行使任何不利于旭宏或/及其关联公司的言论和行为，包括但不限于通过微信、微博、采访、稿件等任何渠道及方式对旭宏或/及其关联公司品牌、声誉造成不利影响。
    7.5 成为视频彩铃广告代言人后，视频彩铃广告代言人有权利不继续接受旭宏提供的相应权益。视频彩铃广告代言人可向旭宏申请取消视频彩铃代言。
    7.6您的账号一旦注销，您曾通过该账号使用的旭宏或/及其关联公司的产品与服务下的所有内容、信息、数据、记录将会被删除或匿名化处理；除法律法规另有规定，您也无法再检索、访问、获取、继续使用和找回，也无权要求旭宏找回。
    7.7 旭宏特别提醒您应妥善保管您的账号信息。因您保管不善导致遭受相关损失，责任由您自行承担。
    7.8视频彩铃广告代言人使用的电话卡为代言人所属公司所有，则旭宏给予的权益归代言人所属公司所有，相关权益以旭宏与代言人所属公司协议为准。
        
8. 协议的变更 
    8.1 旭宏依据本协议的约定变更服务内容、服务方式以及本协议内容，如果视频彩铃广告代言人不同意旭宏的以上任何变更，有权选择取消并停止使用已经获取的对应的全部或部分权益；旭宏有权利通过网页或代言人程序通道对代言人权益进行变更，变更的内容以公布或送达之日起生效。视频彩铃广告代言人仍继续使用旭宏提供的上述权益，则视为视频彩铃广告代言人已经接受旭宏的上述调整的全部内容。
    8.2 旭宏对本协议一旦进行修改，将在页面上或其他适当的位置公示修改的内容。一经公示即视为已成功通知各视频彩铃广告代言人。
    8.3 视频彩铃广告代言人如果不同意条款的修改，可主动向旭宏提出终止视频彩铃广告代言，但至实际终止视频彩铃广告代言所在月的已享受代言人相应权益期间，则视为视频彩铃广告代言人已经接受条款的修改。
    8.4 本协议在更新后，旧的版本可能无法使用。旭宏不保证旧版本协议继续可用及视频彩铃广告代言人的相应权益，请您以变更之后的版本为准。

9. 未成年人条款
    9.1 旭宏非常注重未成年人的保护。若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用视频彩铃广告代言服务。
    9.2 监护人应指导子女上网应该注意的安全问题，防患于未然，并对未成年人使用视频彩铃广告代言进行正确引导、监督。未成年人行使和履行本协议项下的权利和义务即视为已获得了监护人的认可。

10. 法律的适用和管辖 
    10.1 本服务条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，本服务条款因与中华人民共和国现行法律法规相抵触而导致部分无效，不影响其他部分的效力。
    10.2 如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，任何一方均可向旭宏公司所在地人民法院提起诉讼。

11. 其他 
    11.1 如您对本《旭宏视频彩铃广告代言服务协议》或进行视频彩铃广告代言服务相关的事宜有任何问题（包括问题咨询、投诉等），请通过功能页面的用户反馈入口或在线客服与旭宏联系，旭宏会在收到您的意见、建议后尽快向您回复。
    11.2 本协议的标题仅为方便及阅读而设，并不影响正文其中任何规定的含义或解释。
    11.3 本协议于客户确认同意后立即生效。

                昆明旭宏文化传播有限公司`
    }
}